public class homework1 {
    public static void main (String [] args) {
        // * First variant //
        // int a = 1;
        // int b = 7;
        // int c = 15;
        // float d = 2;
        // System.out.println(a*(b+(c/d)));

        // * Two variant //

        int a,b,c;
        float d;
        a=1;
        b=2;
        c=3;
        d=4f;
        System.out.println(a*(b+(c/d)));
    }
}
// * Задание 1
// Написать метод вычисляющий выражение a * (b + (c / d))
// и возвращающий результат с плавающей точкой,
// где a, b, c, d – целочисленные входные параметры этого метода;

// Мать моя женщина, кто же придумал этот git...