public class homework4 {
        private static void name (String a) {
            System.out.println("Привет, " + a + "!");
        }
        public static void main (String[] args) {
            String text ="Филя";
            name(text);
            text = "Герасим";
            name(text);
            text = "Марфуша";
            name(text);

        }
}

// * Задание 4
// Написать метод, которому в качестве параметра передается строка,
// обозначающая имя, метод должен вернуть приветственное сообщение
// «Привет, переданное_имя!»; Вывести приветствие в консоль.


// Мать моя женщина, кто же придумал этот git...